Autodesk.Revit.DB.Structure.LoadBase.IsOrientToPermitted(Autodesk.Revit.DB.Structure.LoadOrientTo)
Indicates if the provided orientation is permitted for this load.
Remarks:
For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted.
For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted.
To determine if load is non-hosted check if Autodesk.Revit.DB.Structure.LoadBase.HostElementId is ElementId.InvalidElementId. Otherwise load is hosted.
orientTo:
Load orientation to check.
Returns:
True if provided orientation type is permitted for this load, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.OrientTo
The load orientation option.
Remarks:
For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted.
For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted.
To determine if load is non-hosted check if Autodesk.Revit.DB.Structure.LoadBase.HostElementId is ElementId.InvalidElementId. Otherwise load is hosted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: orientTo is not permitted for this type of load.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015